Revit 2024 API
FaceArray Class
An array that contains faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class FaceArray : APIObject, IEnumerable
Visual Basic
Public Class FaceArray _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class FaceArray : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FaceArray
See Also
FaceArray Members
Autodesk.Revit.DB Namespace